<h1>Les fonctions</h1>
<p>Extraction_piste_son poss&egrave;de plusieurs fonctions permettant un bon d&eacute;roulement du logiciel.</p>
<p>Dans cette partie vous retrouverai toute les fonctions disponible dans la version 0.5 du logiciel:</p>
<p>&nbsp;</p>
<h3>Ouvrir Fichier Midi</h3>
<p><img src="Icon\Ouvrir_Fichier.png" alt="Bouton Ouvrir fichier MIDI" width="188" height="21" /></p>
<p>Cette fonction permet de choisir le fichier Midi sur lequel le logiciel va travailler permettant d'utilis&eacute; les autres fonctions du logiciel.</p>
<p>L'op&eacute;ration de cette fonction vous demande d'indiqu&eacute; l'endroit ou le fichier Midi se trouve.</p>
<p>&nbsp;</p>
<h3>Chemin d'acc&egrave;s</h3>
<p><img src="Icon\Chemin_acces_barre.png" alt="Barre chemin d'acc&egrave;s du fichier" width="731" height="23" /></p>
<p>Cette fonction permet d'afficher l'endroit ou se situe l'objet sur lequel le logiciel est en train de travailler.</p>
<p>L'op&eacute;ration de cette fonction se r&eacute;alis&eacute; d&eacute;s que l'utilisateur rentre en contact avec la fonction "Ouvrir Fichier Midi" autrement il est impossible d'int&eacute;ragir avec.</p>
<p>&nbsp;</p>
<h3>Cr&eacute;ation Partition</h3>
<p><img src="Icon\Creation_partition2.png" alt="Bouton Cr&eacute;ation paritition" width="241" height="31" /></p>
<p>Cette fonction permet d'effectuer la cr&eacute;ation de la partition en examinant le fichier Midi le logiciel compare les donn&eacute;es du fichier Midi a un tableau interne afin de pouvoir r&eacute;alis&eacute; la partition.</p>
<p>L'op&eacute;ration de cette fonction demande d'indiqu&eacute; l'endroit d'enregistrement.</p>
<p>&nbsp;</p>
<h3>Ouvrir Partition</h3>
<p><img src="Icon\Ouvrir_Partition.png" alt="Bouton Ouvrir Partition" width="241" height="31" /></p>
<p>Cette fonction permet d'ouvrir dans un format plus &eacute;lev&eacute;e que la pr&eacute;visualisation une image de la partition du choix de l'utilisateur.</p>
<p>L'op&eacute;ration de cette fonction demande d'indiqu&eacute; l'emplacement ou se trouve l'image.</p>
<p>&nbsp;</p>
<h3>Modifier Partition</h3>
<p><img src="Icon\Modifier_Partition.png" alt="Bouton Modifier Partition" width="241" height="31" /></p>
<p>Cette fonction permet d'ouvrir l'editeur de partition afin de pouvoir effectuer divers op&eacute;ration sur la partition ( En travaux ).</p>
<p>L'op&eacute;ration de cette fonction demande un fichier Midi de s&eacute;lectionner au pr&eacute;alable.</p>
<p>&nbsp;</p>
<h3>Enregistrer PDF</h3>
<p><img src="Icon\Enregistrer.png" alt="Bouton enregistrer PDF" width="241" height="31" /></p>
<p>Cette fonction permet d'enregistrer sa partition dans un format lisible par tout les syst&egrave;me informatique existant.</p>
<p>L'op&eacute;ration de cette fonction demande d'indiqu&eacute; l'emplacement ou se trouve l'image que l'on souhaite transform&eacute; en PDF et l'emplacement de l'enregistrement.</p>
<p>&nbsp;</p>
<h3>Imprimer</h3>
<p><img src="Icon\Imprimer.png" alt="Bouton Impression" width="241" height="31" /></p>
<p>Cette fonction permet d'imprimer sa partition en format papier a travers une imprimante.</p>
<p>L'op&eacute;ration de cette fonction demande d'indiqu&eacute; l'imprimante avec laquelle le logiciel doit communiquer les information.</p>
<p>&nbsp;</p>
<h3>Pr&eacute;visualisation</h3>
<p><img src="Icon\Pr&eacute;visualisation_Blank.png" alt="Image de la pr&eacute;visualisation" width="263" height="364" /></p>
<p>Cette fonction permet d'afficher une pr&eacute;visualisation de la premi&egrave;re partition qui vient d'etre cr&eacute;er.</p>
<p>Une fonction secondaire permet d'agrandir l'image de la pr&eacute;visualisation &agrave; l'aide d'un simple clique sur la fenetre de pr&eacute;visualisation.</p>
<p>L'op&eacute;ration de cette fonction se r&eacute;alise d&egrave;s que l'utilisateur rentre en contact avec la fonction "Cr&eacute;ation Partition". L'op&eacute;ration de la fonction secondaire peux se r&eacute;alis&eacute; a n'importe quelle moment a l'aide d'un simple clique sur la fenetre.</p>
<p>&nbsp;</p>
<h3>Lecteur Midi</h3>
<p><img src="Icon\Lecteur_Midi.png" alt="Image lecteur Midi g&eacute;neral" width="210" height="63" /></p>
<p>Cette fonction permet d'ecouter le fichier Midi est d'int&eacute;ragir avec la musique.</p>
<p>Le bouton de gauche permet de mettre en pause la musique</p>
<p>Le bouton de droite permet de reprendre la musique ou elle &eacute;tait arreter.</p>
<p>L'onglet "Speed" Permet de r&eacute;gler la vitesse de la musique allant de 0.10x jusqu'a 1.00x.</p>
<p>Le slider permet de ce d&eacute;placer dans la timeline (frise chronologique) de la musique.</p>
<p>L'op&eacute;ration de cette fonction se r&eacute;alise d&egrave;s que l'utilsateur rentre en contact avec la fonction "Ouvrir Fichier Midi", le lecteur est inaccessible autrement.</p>
<h3>&nbsp;</h3>
<h3>Piano Roll</h3>
<p><img src="Icon\Piano_Roll_Blank.png" alt="Image Piano roll vide" width="727" height="478" /></p>
<p>Cette fonction permet <span lang="fr" tabindex="0"> d'afficher le contenu d'un fichier Midi dans une forme autre que la partition.</span></p>
<p><span lang="fr" tabindex="0">L'op&eacute;ration de cette fonction se r&eacute;alise d&egrave;s que l'utilisateur rentre en contact avec la fonction "Cr&eacute;ation partition", Le piano Roll reste vide tant que l'int&eacute;raction avec la fonction n'a pas lieu.</span></p>