<h1 dir="ltr" data-placeholder="Traduction">Le logiciel et ses composants</h1>
<p><span lang="fr" tabindex="0">La capture d'&eacute;cran suivante montre le logiciel en cours d'utilisation:</span></p>
<p><span lang="fr" tabindex="0"><img src="Icon\Logiciel.png" alt="Logiciel en fonction" width="1000" height="632" /></span></p>
<p><span lang="fr" tabindex="0">En haut du logiciel se trouvent la barre de menus et dans la partie gauche du logiciel ce trouve la barre d'outils qui contiennent des boutons permettant de charger des fichiers, de lire le fichier actuellement charg&eacute; grace au lecteur int&eacute;gr&eacute;. De plus, les param&egrave;tres sont accessibles depuis la barre de menus et des outils suppl&eacute;mentaires, tels que le plein &eacute;cran, peuvent &ecirc;tre activ&eacute;s depuis le menu. <br /></span></p>
<p><span lang="fr" tabindex="0">Au centre du logiciel </span><span lang="fr" tabindex="0">, l&rsquo;&eacute;cran principal est divis&eacute; en deux parties. Sur le c&ocirc;t&eacute; gauche, on y retrouve diff&eacute;rente fonction accessible a travers divers bouton. E</span>t du cot&eacute; droit, diff&eacute;rente fonction permetant de cr&eacute;er la partition et de permettre a l'utilisateur d'evoluer dans le logiciel avec l'acc&eacute;s a l'editeur et d'autre fonctionnalit&eacute;.</p>
<h2>Barre de Menu</h2>
<p><span lang="fr" tabindex="0">La plupart des actions pouvant &ecirc;tre effectu&eacute;es par l'utilisateur sont accessibles &agrave; l'aide de la barre de menus. Les actions sont structur&eacute;es dans les sous-revenus suivants:</span></p>
<ul style="list-style-type: disc;">
<li><span lang="fr" tabindex="0"><strong>Fichier</strong> </span></li>
</ul>
<p><span lang="fr" tabindex="0">Le menu Fichier fournit les actions habituelles pour charger et sauvegarder des fichiers.</span></p>
<ul style="list-style-type: disc;">
<li><strong><span lang="fr" tabindex="0">Affichage</span></strong></li>
</ul>
<p><span lang="fr" tabindex="0">Le menu Affichage propose des actions pour personnaliser les param&egrave;tres d'affichage.<br /></span></p>
<ul style="list-style-type: disc;">
<li><strong><span lang="fr" tabindex="0">Aide</span></strong></li>
</ul>
<p><span lang="fr" tabindex="0">Le menu Aide propose l'acc&egrave;s a diff&eacute;rent information compl&eacute;mentaire a propos du logiciel.<br /></span></p>
<h2><span lang="fr" tabindex="0">Barre d'outils</span></h2>
<p><span lang="fr" tabindex="0">La barre d&rsquo;outils contient des &eacute;l&eacute;ments de la barre de menu afin de permettre un acc&egrave;s rapide aux actions les plus fr&eacute;quemment utilis&eacute;es.</span></p>
<h2><span lang="fr" tabindex="0">Pr&eacute;visualisation</span></h2>
<p><span lang="fr" tabindex="0">La pr&eacute;visualisation est un &eacute;l&eacute;ment important du logiciel. Il permet a l'utilisateur d'avoir un aper&ccedil;u de partition du fichier Midi qui a &eacute;tait s&eacute;lectionn&eacute; pr&eacute;c&eacute;demment.</span></p>
<p><span lang="fr" tabindex="0"><img src="Icon\Previsualisation.png" alt="Previsualisation" width="261" height="362" /></span></p>
<p><span lang="fr" tabindex="0">La fa&ccedil;on dont est r&eacute;alis&eacute; la partition est simple elle suis le m&ecirc;me schema que une partition classique ou l'on peux retrouver les informations suivante :</span></p>
<p><span lang="fr" tabindex="0">-La barre de mesure</span></p>
<p><span lang="fr" tabindex="0">-Les clefs (Cl&eacute; de sol,fa,ut)</span></p>
<p><span lang="fr" tabindex="0">-Chiffrages de mesures</span></p>
<p><span lang="fr" tabindex="0">-Notes et Silences</span></p>
<p><span lang="fr" tabindex="0">-Alt&eacute;rations</span></p>
<p><span lang="fr" tabindex="0">-Octaviation</span></p>
<p><span lang="fr" tabindex="0">-Point de prolongation</span></p>
<p><span lang="fr" tabindex="0">-Point d'orgue</span></p>
<p><span lang="fr" tabindex="0">-Et la liste continue...</span></p>
<p><span lang="fr" tabindex="0">Pour &eacute;diter la partition, l'utilisateur doit s&eacute;lectionner l'option "Modifier la partition" dans la barre de menu ou dans la barre d'outils.<br /></span></p>
<h2><span lang="fr" tabindex="0">Piano Roll</span></h2>
<p><span lang="fr" tabindex="0">Le Piano Roll permet d'afficher le contenu d'un fichier Midi dans une forme autre que la partition cette affichage reprend le principe du rouleau de piano pneumatique ou le principe etait une bande de papier perfor&eacute;e dont les trous repr&eacute;sentent les notes ainsi que d'autres donn&eacute;es de contr&ocirc;le gr&acirc;ce &agrave; la position et la longueur des perforations.</span></p>
<p><span lang="fr" tabindex="0">Exemple du piano roll en fonction:</span></p>
<p><span lang="fr" tabindex="0"><img src="Icon\Piano_Roll.png" alt="Piano_Roll" width="681" height="411" /></span></p>