<h1>Methode d'utilisation</h1>
<p>Extraction_piste_son &agrave; &eacute;tait programm&eacute; pour fonctionner dans un ordre pr&eacute;cis ici ce trouve la methode d'utilisation vous permettant de faire fonctionner le logiciel de A &agrave; Z simplement en suivant les &eacute;tapes qui vous seront propos&eacute; ci-dessous</p>
<p>&nbsp;</p>
<h2>Fichier Midi</h2>
<p>En effet le logiciel tourne autour de ce fichier. Dans un premier temps l'utilisateur dois introduire son fichier Midi afin de pouvoir continuer d'&eacute;voluer dans le logiciel.</p>
<p>Pour cela il suffit de s&eacute;lectionner le bouton "Ouvrir Fichier MIDI"</p>
<p><img src="Icon\Ouvrir_Fichier.png" alt="Bouton ouvrir fichier Midi" width="188" height="21" /></p>
<p>Une fenetre de dialogue vous demandera de s&eacute;lectionner le fichier Midi avec lequel vous souhaitez travailler.</p>
<p>Une fois le fichier s&eacute;lectionner veuillez vous assurez que le chemin d'acc&egrave;s est bien mis &agrave; jour comme ceci :</p>
<p><img src="Icon\Chemin_acces.png" alt="Chemin d'acces" width="265" height="24" /></p>
<p>Si ce n'est pas le cas veuillez recommencer le processus pr&eacute;cedent.</p>
<p>&nbsp;</p>
<h2>Cr&eacute;ation Partition</h2>
<p>Une fois l'&eacute;tape pr&eacute;c&eacute;dente effectuer il vous manque plus que cr&eacute;er la partition pour cela vous remarquerez que au centre de l'&eacute;cran se trouve plusieurs bouton &agrave; votre disposition.</p>
<p>Pour votre cas il suffit de s&eacute;lectionner le bouton "Cr&eacute;ation partition"</p>
<p><img src="Icon\Creation_partition2.png" alt="Bouton cr&eacute;ation partition" width="241" height="31" /></p>
<p>Une fenetre de dialogue vous demandera de choisir l'emplacement ou vous souhaitez que les partitions s'enregistre.</p>
<p>Une fois cela un aper&ccedil;u de la partition sera disponible dans la fenetre de pr&eacute;visualisation et une fenetre de dialogue vous demandant si la partition vous semble correcte ou non (Il existe une possibilit&eacute; que la partition ne sois pas parfaite il ne faut pas h&eacute;siter a dire non).</p>
<p><img src="Icon\Dialogue_partition.png" alt="Fenetre de dialogue parition" width="317" height="128" /></p>
<p>En s&eacute;lectionnant "Oui" vous aurez de nouveau acc&egrave;s a tout les autres fonctionnalit&eacute; du logiciel&nbsp;</p>
<p>En s&eacute;lectionnant "Non" le logiciel vous d&eacute;placera automatiquement sur la fenetre de modification manuel afin de vous donner la possibilit&eacute; de modifier la partition comme vous le souhaitez.</p>
<p>&nbsp;</p>
<h2>Finalisation</h2>
<p>Maintenant que les modifications sur les partition sont termin&eacute; il existe deux fonction que vous pouvez utilis&eacute; afin de finir la boucle</p>
<p>La premi&egrave;re concerne l'enregistrement en PDF</p>
<p>Pour cela il suffit de s&eacute;lectionner le bouton "Enregistrement en PDF"</p>
<p><img src="Icon\Enregistrer.png" alt="Bouton Enregistrement PDF" width="241" height="31" /></p>
<p>Une fenetre de dialogue vous demandera de s&eacute;lectionner la partition que vous souhaiter enregistrer en PDF et vous demandera de choisir l'emplacement ou vous souhaitez que la partition sois enregistrer en PDF.</p>
<p>A la fin du dialogue la partition sera transformer en format PDF a l'endroit que vous avez s&eacute;lectionner.</p>
<p>La deuxi&egrave;me solution concerne l'impression de la partition</p>
<p>Pour cela il suffit de s&eacute;lectionner le bouton "Imprimer"</p>
<p><img src="Icon\Imprimer.png" alt="Bouton d'impression" width="241" height="31" /></p>
<p>Une fenetre vous demandera de s&eacute;lectionner l'imprimante de votre choix afin que l'impression puisse s'effectuer</p>
<p>(La partition imprim&eacute;e sera la partition de la pr&eacute;visualisation)</p>
<p>Une fois l'impression parametr&eacute;r l'impression s'effecturera.</p>
<p>&nbsp;</p>
<p>Il existe divers fonction annexes permettant une meilleur exp&eacute;rience de l'utilisateur vous pouvez les retrouver <a title="Les fonctions" href="Les%20fonctions.html" target="_blank" rel="noopener">Ici</a></p>